/***************************************************************************************************
  * 文 件 名: mpu6050.h
  * 作    者：罗民
  *	日    期：2014/7/10
  * 版    本：V1.0
  * 开 发 板：TM4C123G6PZ--实验开发板
  * 修改时间：无 
  * 编 译 器: keil.4.54
  *-------------------------------------------------------------------------------------------------
  * 简    介:
  * 参    考:
  *	笔记名称:
  * 注    意：
  *************************************************************************************************/ 
	/* ------------防止递归包含的定义---------------------------------------------------------------*/
#ifndef __MPU6050_H
#define __MPU6050_H

#ifdef __cplusplus
 extern "C" {
#endif 

/* --------------头文件包含 ----------------------------------------------------------------------*/
#include "mygpio.h"
#include "inc/hw_memmap.h"
#include "driverlib/gpio.h" 
#include "driverlib/rom.h" 
#include "sysclock.h"
/**************************************************************************************************/
/*--------------开关定义--------------------------------------------------------------------------*/
#define FALSE 0x00
#define TRUE  0x01
/**************************************************************************************************/

/* -------------出口变量模型----------------------------------------------------------------------*/
#define SCL_H         GPIOPinWrite(GPIO_PORTA_BASE, GPIO_PIN_7,GPIO_PIN_7)
#define SCL_L         GPIOPinWrite(GPIO_PORTA_BASE, GPIO_PIN_7,0x00)
	 
#define SDA_H         {GPIOPinWrite(GPIO_PORTA_BASE, GPIO_PIN_6,GPIO_PIN_6);}
#define SDA_L         {GPIOPinWrite(GPIO_PORTA_BASE, GPIO_PIN_6,0x00);}

typedef struct 
{
	int16_t Gyro_Data[3];     
	int16_t Acc_Data[3];             // x,y,z
}MPU6050_Typedef;

/**************************************************************************************************/	 
	 
/*--------------出口函数--------------------------------------------------------------------------*/
void Simulation_II2C_GPIO_Config(void);
void Congfigration_mpu6050(void);
void MPU6050_Init(void);
void Get_MPU6050_FilterAfter_Data(volatile MPU6050_Typedef* _6050data);
void Get_MPU6050_firstData(volatile MPU6050_Typedef* _6050data);
/**************************************************************************************************/


#ifdef __cplusplus
}
#endif

#endif 

/*****************************@版权 luomin*********************************************************/
