/***************************************************************************************************
  * 文 件 名: PID_Count.c
  * 作    者：罗民
  *	日    期：2014/7/10
  * 版    本：V1.0
  * 开 发 板：TM4C123G6PZ--实验开发板
  * 修改时间：无 
  * 编 译 器: keil.4.54
  *-------------------------------------------------------------------------------------------------
  * 简    介:
  * 参    考:
  *	笔记名称:
  * 注    意：
  *************************************************************************************************/  
/*--------包含头文件------------------------------------------------------------------------------*/
#include "PID_Count.h"
/**************************************************************************************************/
/*--------变量的定义-------------------------------------------------------------------------------*/
PID_Typedef  Roll_PID,Pitch_PID,Yaw_PID;
/**************************************************************************************************/
/*--------  宏定义 -------------------------------------------------------------------------------*/
#define      Roll_Pitch_Kp                  	400 //300// 250//400//300       
#define      Roll_Pitch_Ki                    2//2//3
#define      Roll_Pitch_Kd                 3000//4000//3000//2300//2500//2000//1200//2000//3000

#define      Yaw_Kp                       1400// 6200//6000//8000//5000//3000//2000//1000//1600//1500//1300
#define      Yaw_Ki                        20 // 1.0
#define      Yaw_Kd                        18000   //  18000//30000//40000//50000

/**************************************************************************************************/
/*-------进口函数----------------------------------------------------------------------------------*/

/**************************************************************************************************/
/*--------函数模型----------------------------------------------------------------------------------*/
/***************************************************************************************************
	函数名: PID_Init
	输  入: void
	输  出:	void
	功  能:	PID 初始化
****************************************************************************************************/	
void PID_Init(void)
{
	Roll_PID.Kp = Roll_Pitch_Kp;
	Roll_PID.Ki = Roll_Pitch_Ki;
	Roll_PID.Kd = Roll_Pitch_Kd;
	Roll_PID.Error = 0;
	Roll_PID.PreError = 0;
	Roll_PID.PPreError = 0;
// 	Roll_PID.PIDInter_Sum =0;
 	Roll_PID.PIDInter_Sum =1000;
	
	Pitch_PID.Kp = Roll_Pitch_Kp;
	Pitch_PID.Ki = Roll_Pitch_Ki;
	Pitch_PID.Kd = Roll_Pitch_Kd;
	Pitch_PID.Error = 0;
	Pitch_PID.PreError = 0;
	Pitch_PID.PPreError = 0;
// 	Pitch_PID.PIDInter_Sum =0;
 	Pitch_PID.PIDInter_Sum =1000;
	
	Yaw_PID.Kp = Yaw_Kp;
	Yaw_PID.Ki = Yaw_Ki;
	Yaw_PID.Kd = Yaw_Kd;
	Yaw_PID.Error = 0;
	Yaw_PID.PreError = 0;
	Yaw_PID.PPreError = 0;
// 	Yaw_PID.PIDInter_Sum =0;
 	Yaw_PID.PIDInter_Sum =-2000;



}
/***************************************************************************************************
	函数名: PID_Count
	输  入: ppid      结构体地址
	输  出:	void
	功  能:
****************************************************************************************************/	
void PID_Count(PID_Typedef* ppid)
{
	ppid->PIDFin_Sum = ppid->Error*(ppid->Kp);                   
	ppid->PIDInter_Sum += ppid->Error*(ppid->Ki);
	if(ppid->PIDInter_Sum > 1000000000) ppid->PIDInter_Sum  = 1000000000;
	else if(ppid->PIDInter_Sum < -1000000000) ppid->PIDInter_Sum  = -1000000000;
	ppid->PIDFin_Sum += ppid->PIDInter_Sum;
	ppid->PIDFin_Sum += (((ppid->PreError)-(ppid->PPreError)) + (ppid->Error-(ppid->PreError)))*(ppid->Kd)/2;
	ppid->PPreError = ppid->PreError;
	ppid->PreError = ppid->Error;
}
/***************************************************************************************************
	函数名: Attitude_PID_Process
	输  入: void
	输  出:	void
	功  能: 姿态PID计算过程
****************************************************************************************************/	
void Attitude_PID_Process(void)
{
	PID_Count(&Roll_PID);
	PID_Count(&Pitch_PID);
	PID_Count(&Yaw_PID);
}

/*****************************@版权 luomin*********************************************************/
